In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'coluna1':[1,2,3,4],
             'coluna2':[111,222,333,222],
             'coluna3':['aaa','bbb','ccc','ddd']})
df

   coluna1  coluna2 coluna3
0        1      111     aaa
1        2      222     bbb
2        3      333     ccc
3        4      222     ddd

In [3]:
#pandas
df['coluna2'].unique()

array([111, 222, 333], dtype=int64)

In [4]:
#numpay
np.unique(df['coluna2'])

array([111, 222, 333], dtype=int64)

In [5]:
#quantidade de valores unicos

#len(df['coluna2'].unique())

#ou

df['coluna2'].nunique()

3

In [6]:
#Quantas vezes o dado se repete
df['coluna2'].value_counts()

222    2
111    1
333    1
Name: coluna2, dtype: int64

In [7]:
#condicional E/&

df[(df['coluna1']>2) & (df['coluna2'] == 222)]

   coluna1  coluna2 coluna3
3        4      222     ddd

In [8]:
#executando função dentro do dataframe
#APPLY

def vezes2(x): return x * 2

df['coluna2'].apply(vezes2)

# executando com lambda
df['coluna2'].apply(lambda x: x * 2)

0    222
1    444
2    666
3    444
Name: coluna2, dtype: int64

In [9]:
#APPLY
#contando a quantidade de string em cada coluna
df['coluna3'].apply(len)

0    3
1    3
2    3
3    3
Name: coluna3, dtype: int64

In [10]:
#deletar colunas

del df['coluna3']
df

   coluna1  coluna2
0        1      111
1        2      222
2        3      333
3        4      222

In [11]:
#odernar - SORTBY

df.sort_values(by='coluna2')

   coluna1  coluna2
0        1      111
1        2      222
3        4      222
2        3      333

In [12]:
#VALORES NULOS

dfnulo = pd.DataFrame({'coluna1':[1,2,3,4,5],
             'coluna2':[111,222,333,222,np.nan],
             'coluna3':['aaa','bbb','ccc',np.nan,'ddd']})
dfnulo

   coluna1  coluna2 coluna3
0        1    111.0     aaa
1        2    222.0     bbb
2        3    333.0     ccc
3        4    222.0     NaN
4        5      NaN     ddd

In [21]:
#substituindo valores nulos pela media
dfnulo['coluna2'].fillna(value = df['coluna2'].mean(), inplace=True)
dfnulo

   coluna1  coluna2 coluna3
0        1    111.0     aaa
1        2    222.0     bbb
2        3    333.0     ccc
3        4    222.0     NaN
4        5    222.0     ddd

In [22]:
#PIVOT_TABLE
#tabela dinamica

paises = {
'Key': [1, 2 , 3],
'País': ['Brasil', 'Brasil', 'Brasil'],
'Estado': ['Minas Gerais', 'São Paulo', 'Rio de Janeiro'],
'População': [123465, 456789, 987654]}


dfPaises = pd.DataFrame(paises)
dfPaises

   Key    País          Estado  População
0    1  Brasil    Minas Gerais     123465
1    2  Brasil       São Paulo     456789
2    3  Brasil  Rio de Janeiro     987654

In [23]:
#PIVOT_TABLE
#tabela dinamica

dfPaises.pivot_table(values='População', index=['País','Estado'])

                       População
País   Estado
Brasil Minas Gerais       123465
       Rio de Janeiro     987654
       São Paulo          456789